{

		
		"home":
		[
			{
				"title":"HOME",
				"location":"Intrepica",
				"dates":[{"from":"", "to":""},{"from":"","to":""}],
				"image":"http://www.placehold.it/100x100",
				"description": "<div class='jumbotron'> <h1>Hello, world!</h1>  <p><a class='btn btn-primary btn-lg' role='button'>Learn more</a></p></div>"
			}
		
		],
		"employers":
		[			
			{
				"title":"Contract Flash Developer",
				"location":"Just Digital People",
				"dates":[{"from":"Feb '14", "to":"Present"}],
				"image":"images/employers/justdigitalpeople.jpg",
				"description": "I am currently working as a contract flash developer."
			},
			{
				"title":"Flash Developer",
				"location":"Intrepica",
				"dates":[{"from":"Sept '12", "to":"Nov '13"}],
				"image":"images/employers/intrepica.jpg",
				"description": "The majority of work at Intrepica was on their flagship product 'LiteracyPlanet'. This involved updating old and creating new flash based elements. I created a Facebook app for their yearly 'WordMania' promotion in '12 and '13, along with some web development in '13."
			},
			{
				"title":"UI Programmer",
				"location":"Sega Studios Australia",
				"dates":[{"from":"Jun '11", "to":"Jun '12"}],
				"image":"images/employers/ssa.jpg",
				"description": "I worked on UI elements for Official '12 Olympics Games game using Flash and Scaleform to create menus, HUDs and in game elements. I also fulfilled a personal goal of working for a gaming company."
			},
			{
				"title":"Flash Developer",
				"location":"Hoodlum",
				"dates":[{"from":"Apr '10", "to":"May '11"},{"from":"Jun '08","to":"Apr '09"}],
				"image":"images/employers/hoodlum.jpg",
				"description": "At Hoodlum I was involved in creating Flash content to the highest standard for world class clients. Many projects went on to win awards such as Emmys and Baftas. There were tight deadlines and many, many paid for dinners but i look back at this time with great satisfaction. I worked with many talented friends and we created some wonderful projects"
			}
			,
			{
				"title":"Flash Developer",
				"location":"Liquid Interactive",
				"dates":[{"from":"Apr '09", "to":"Mar '10"},{"from":"Dec '06","to":"May '08"}],
				"image":"images/employers/liquidinteractive.jpg",
				"description": "Liquid was my first and third job into my career. I worked on a great deal of education materials that had to meet strict educational standards. I was instumental in udating their Flash Development processes, bringing the knowledge to upskill their lead developer from AS2 to AS3"
			},
			{
				"title":"Tutor",
				"location":"Griffith University",
				"dates":[{"from":"Mar '05", "to":"Jun '06"}],
				"image":"images/griffithuniversity.jpg",
				"description": "Being a Tutor when I was a student myself was a great benefit. Teaching others what I had learnt in the previous few years solidified my knowledge and confirmed my passion for the subject."
			},
			{
				"title":"Multimedia Developer Traineeship",
				"location":"Mt. Gravatt TAFE",
				"dates":[{"from":"Mar '00", "to":"Jun '01"}],
				"image":"images/mtgravatttafe.jpg",
				"description": "I was a Multimedia Developer when Multimedia was still a buzz word. I created many education and promotional materials for the TAFE across a broad selection of media; video, audio, web, flash etc. It was a time when most of these materials were delivered via CD-ROM"
			}
			

		],
		
		"education":
		[
			{
				"title":"Web Development",
				"location":"Self Taught",
				"dates":[{"from":"Dec '13", "to":"Present"}],
				"image":"images/me.jpg",
				"description": "Since being made redudent and the obvious lack of Flash Dev jobs with the inevitable death of Flash coming, I have decided to upskill in Web Development. <br />I have always had a basic knowledge of Web Development which has allowed me to grow on those skills quite easily.<br /> I am now proficient in HTML5, CSS3, Javascript, Jquery and Bootstrap and have limited skills with PHP and Apache Server."
			},
			{
				"title":"Bachelor Of Multimedia",
				"location":"Griffith University",
				"dates":[{"from":"Mar '03", "to":"Nov '06"}],
				"image":"images/griffithuniversity.jpg",
				"description": "I majored in Interactive Entertainment; 2d and 3d Game Development. Final GPA: 6.348. Griffith Award for Academic Excellence '04, '05, '06. The course covered all areas of multimedia development including design, sound & video production, documentation and project management. The major covered game design, 2d/3d asset creation and OOP game programming."
			},
			{
				"title":"Certificate in I.T.",
				"location":"Southbank TAFE",
				"dates":[{"from":"Apr '00", "to":"Apr '01"}],
				"image":"images/education/southbanktafe.jpg",
				"description": "This was a basic I.T. course I completed as part of a traineeship at Mt. Gravatt TAFE. I learnt how to build a computer, the basics of networking along with other generic I.T. skills. "
			},
			{ 
				"title":"Diploma Of Multimedia",
				"location":"Mt. Gravatt TAFE",
				"dates":[{"from":"Feb '99", "to":"Dec '99"}],
				"image":"images/mtgravatttafe.jpg",
				"description": "I extended what I have previously learnt to develop multimedia projects with Flash and Director. We were required to build a project for a real-world client, ours being 'A Guide to Brisbane Skate-parks' CD-ROM for the Brisbane City Council. It is still available to this day at public libraries."
			},
			{
				"title":"Certificate in Digital Art",
				"location":"Mt. Gravatt TAFE",
				"dates":[{"from":"Feb '98", "to":"Dec '98"}],
				"image":"images/mtgravatttafe.jpg",
				"description": "This was the initial course that set me on the path to my career. It consisted mostly of art projects, half real life installations and half using computers. It was my introduction to  Photoshop and Flash, two programs I would still use to this day"
			}
		],
		
		"projects":
		[
			{
				"title":"Anthony Ponomarenko",
				"location":"Freelance",
				"dates":[{"from":"", "to":""},{"from":"","to":""}],
				"image":"images/projects/pono.jpg",
				"description": "I created this very site for myself to showcase what I have learnt since changing directions to become a Web Developer. <br />It used HTML5, CSS3, Javascript, Jquery (along with some plugins) and Bootstrap. <br />All data is contained in a JSON file and elements are built from this at run time. PHP is as a query string parser as well as to build a HTML email that is sent to myself and the sender of the contact form.<br />I also used the Validate plugin for JQuery to enhance the validation on the contact form."
			},
			{
				"title":"Donnas Cupcakes",
				"location":"Freelance",
				"dates":[{"from":"", "to":""},{"from":"","to":""}],
				"image":"images/projects/donnascupcakes.jpg",
				"description": "This is a small site I created to begin upskilling in Web Development. It was made to order cakes to support fund raising for my participation in the Ride to Conquer Cancer. It was built with HTML5, CSS3 and Javascript.<br />I wrote the image scroller from scratch in JS and used PHP to pull all images from the corresponding directory. It also contains an order form where cake types can be created and added to an order list. This list is then sent in a HTML email via PHP."
			},
			{
				"title":"LiteracyPlanet",
				"location":"Intrepica",
				"dates":[{"from":"", "to":""},{"from":"","to":""}],
				"image":"images/projects/literacyplanet.jpg",
				"description": "LiteracyPlanet is the flagship product of Intrepica. I worked on many areas within the Flash based product mainly updating and optimising old components. Most notable was recreating a game using a framework that incorporated a physics engine."
			},
			{
				"title":"National WordMania Challenge",
				"location":"Intrepica",
				"dates":[{"from":"", "to":""},{"from":"","to":""}],
				"image":"images/projects/wordmania13.jpg",
				"description": "This project consisted of multiple seperate projects. A Facebook app for the 2012 Australian competition. An updated app for the 2013 Australian Competition and also one for the 2013 Malaysian Competition. These used the Facebook Javascript api to perform several operations such as saving high scores, posting to timeline and other social tasks. I also worked on the 2013 web site using HTML5, CSS3 Javascript, Jquery and Bootstrap"
			},
			{
				"title":"London 2012: The Official Video Game",
				"location":"Sega Studios Australia",
				"dates":[{"from":"", "to":""},{"from":"","to":""}],
				"image":"images/projects/london2012.jpg",
				"description": "This was the first Console game I worked on. I was a UI developer and created menus, HUDs and in game elements with Flash and Scaleform. Being a gamer myself, it was also pretty cool to have my name in the credits of a computer game."
			},
			{
				"title":"Slide",
				"location":"Hoodlum",
				"dates":[{"from":"", "to":""},{"from":"","to":""}],
				"image":"images/projects/slide.jpg",
				"description": "<b>Awards</b>: <br />WINNER: AIMIA Awards 2011: Best In Class<br />NOMINEE: International Digital Emmy Awards 2012 – Best  Digital  Program: Fiction <br />By far this was the most ambitious site I have worked on. It was part of a multi-platform experience "
			}
			,
			{
				"title":"Dance Academy",
				"location":"Hoodlum",
				"dates":[{"from":"", "to":""},{"from":"","to":""}],
				"image":"images/projects/danceacademy.jpg",
				"description": "<b>Awards</b>: <br />WINNER: KidScreen Awards 2011: Best Television Companion Site<br /><br />This was the first large project on which I was Lead Developer. It was a project in collaboration with the ABC and ZDF. It was a compliment website to a popular show that had story arcs told through text, audio and video assets made available via a CMS as the show was screened on TV.  "
			},		
			{
				"title":"Salt: Day X Exists",
				"location":"Hoodlum",
				"dates":[{"from":"", "to":""},{"from":"","to":""}],
				"image":"images/projects/salt.jpg",
				"description": "<b>Awards</b>: <br />WINNER: Primetime Creative Arts Emmy 2009 – Achievement  in  Interactive  Media  Programming<br /><br />"
			}
			,
			{
				"title":"Dharma Wants you",
				"location":"Hoodlum",
				"dates":[{"from":"", "to":""},{"from":"","to":""}],
				"image":"images/projects/dharmawantsyou.jpg",
				"description": "<b>Awards</b>:<br /> WINNER: Primetime Creative Arts Emmy 2009: Outstanding Creative Achievement in Interactive Media – Fiction.<br /><br />"
			}
			,
			{
				"title":"Batman: Who is the Villian",
				"location":"Liquid Interactive",
				"dates":[{"from":"", "to":""},{"from":"","to":""}],
				"image":"images/projects/batman.jpg",
				"description": "Built for Warner Brothers this was the first large scale Flash game on which I was lead developer. It was build from scratch by myself and the at time lead flash developer from the company. I taught him OOP and AS3 "
			}
		
		]
	
}